src/src/Enums/OperationTypesCashVoucher.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>OperationTypesCashVoucher</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Salary</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SalaryForEmployee</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Taxes</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ToAdvanceHolder</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ToCustomer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Vendor</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Other</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TransferToCashCR</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherSettlements</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LoanSettlements</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IssueLoanToEmployee</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/src/Enums/OperationTypesPaymentExpense.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>OperationTypesPaymentExpense</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Vendor</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ToCustomer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ToAdvanceHolder</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Salary</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Other</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Taxes</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherSettlements</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LoanSettlements</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IssueLoanToEmployee</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/src/Enums/OperationTypesCashReceipt.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>OperationTypesCashReceipt</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>FromCustomer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FromVendor</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FromAdvanceHolder</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RetailIncome</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RetailIncomeEarningAccounting</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CurrencyPurchase</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Other</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherSettlements</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LoanSettlements</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LoanRepaymentByEmployee</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/src/Enums/OperationTypesPaymentReceipt.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>OperationTypesPaymentReceipt</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>FromCustomer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FromVendor</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FromAdvanceHolder</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CurrencyPurchase</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Other</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Taxes</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherSettlements</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LoanSettlements</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LoanRepaymentByEmployee</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/src/Documents/ArApAdjustments.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>ArApAdjustments</Name>
			<BasedOn>
				<xr:Item>Document.ReconciliationStatement</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.InvoicesAndOrdersPayment</xr:Item>
				<xr:Item>AccumulationRegister.IncomeAndExpensesCashMethod</xr:Item>
				<xr:Item>AccountingRegister.AccountingJournalEntries</xr:Item>
				<xr:Item>AccumulationRegister.AccountsReceivable</xr:Item>
				<xr:Item>AccumulationRegister.IncomeAndExpenses</xr:Item>
				<xr:Item>AccumulationRegister.AccountsPayable</xr:Item>
				<xr:Item>AccumulationRegister.IncomeAndExpensesRetained</xr:Item>
				<xr:Item>AccumulationRegister.UnallocatedExpenses</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OperationKind</Name>
					<Type>
						<v8:Type>cfg:EnumRef.OperationTypesArApAdjustments</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Contract</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CounterpartyContracts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Counterparty</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CounterpartySource</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Multiplicity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExchangeRate</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SettlementsAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AccountingAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Correspondence</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.PrimaryChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AccountsDocument</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.FixedAssetSale</v8:Type>
						<v8:Type>cfg:DocumentRef.SalesInvoice</v8:Type>
						<v8:Type>cfg:DocumentRef.AccountSalesFromConsignee</v8:Type>
						<v8:Type>cfg:DocumentRef.SupplierInvoice</v8:Type>
						<v8:Type>cfg:DocumentRef.PaymentExpense</v8:Type>
						<v8:Type>cfg:DocumentRef.SubcontractorReportIssued</v8:Type>
						<v8:Type>cfg:DocumentRef.ExpenseReport</v8:Type>
						<v8:Type>cfg:DocumentRef.CashReceipt</v8:Type>
						<v8:Type>cfg:DocumentRef.SalesOrder</v8:Type>
						<v8:Type>cfg:DocumentRef.SubcontractorReport</v8:Type>
						<v8:Type>cfg:DocumentRef.AccountSalesToConsignor</v8:Type>
						<v8:Type>cfg:DocumentRef.CashVoucher</v8:Type>
						<v8:Type>cfg:DocumentRef.PaymentReceipt</v8:Type>
						<v8:Type>cfg:DocumentRef.AdditionalExpenses</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AdvanceFlag</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Order</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SalesOrder</v8:Type>
						<v8:Type>cfg:DocumentRef.PurchaseOrder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BasisDocument</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ReconciliationStatement</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Debitor</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Contract</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CounterpartyContracts</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Document</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.FixedAssetSale</v8:Type>
								<v8:Type>cfg:DocumentRef.SalesInvoice</v8:Type>
								<v8:Type>cfg:DocumentRef.AccountSalesFromConsignee</v8:Type>
								<v8:Type>cfg:DocumentRef.SupplierInvoice</v8:Type>
								<v8:Type>cfg:DocumentRef.SubcontractorReportIssued</v8:Type>
								<v8:Type>cfg:DocumentRef.CashReceipt</v8:Type>
								<v8:Type>cfg:DocumentRef.SalesOrder</v8:Type>
								<v8:Type>cfg:DocumentRef.ArApAdjustments</v8:Type>
								<v8:Type>cfg:DocumentRef.PaymentReceipt</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Order</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.SalesOrder</v8:Type>
								<v8:Type>cfg:DocumentRef.WorkOrder</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Multiplicity</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ExchangeRate</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AdvanceFlag</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SettlementsAmount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AccountingAmount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Creditor</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Contract</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CounterpartyContracts</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Document</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.SupplierInvoice</v8:Type>
								<v8:Type>cfg:DocumentRef.PaymentExpense</v8:Type>
								<v8:Type>cfg:DocumentRef.ExpenseReport</v8:Type>
								<v8:Type>cfg:DocumentRef.SubcontractorReport</v8:Type>
								<v8:Type>cfg:DocumentRef.AccountSalesToConsignor</v8:Type>
								<v8:Type>cfg:DocumentRef.CashVoucher</v8:Type>
								<v8:Type>cfg:DocumentRef.ArApAdjustments</v8:Type>
								<v8:Type>cfg:DocumentRef.AdditionalExpenses</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Order</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.PurchaseOrder</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Multiplicity</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ExchangeRate</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AdvanceFlag</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SettlementsAmount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AccountingAmount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/src/CommonForms/SelectDocumentOfSettlements/Ext/Form/Module.bsl
#Region GeneralPurposeProceduresAndFunctions

// Gets query for customer settlement document selection for "Payment receipt" and "Cash receipt" documents.
// 
&AtServerNoContext
Function GetQueryTextAccountDocumentsOfAccountsReceivableReceipt()
	
	QueryText =
	"SELECT
	|	UNDEFINED AS Ref,
	|	DATETIME(1, 1, 1) AS Date,
	|	""000000000000"" AS Number,
	|	VALUE(Catalog.Companies.EmptyRef) AS Company,
	|	&CounterpartyByDefault AS Counterparty,
	|	&ContractByDefault AS Contract,
	|	0 AS Amount,
	|	&Currency AS Currency,
	|	UNDEFINED AS Type,
	|	0 AS DocumentStatus
	|WHERE
	|	FALSE
	|";
	
	If AccessRight("Read", Metadata.Documents.ArApAdjustments) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	&ContractByDefault,
		|	DocumentData.SettlementsAmount,
		|	VALUE(Catalog.Currencies.EmptyRef),
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.ArApAdjustments AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.AccountSalesFromConsignee) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	DocumentData.Contract,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.AccountSalesFromConsignee AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.SubcontractorReportIssued) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	DocumentData.Contract,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.SubcontractorReportIssued AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.FixedAssetSale) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	DocumentData.Contract,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.FixedAssetSale AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.SalesInvoice) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	DocumentData.Contract,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.SalesInvoice AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If Left(QueryText, 10) = "UNION" Then
		QueryText = Mid(QueryText, 14);
	EndIf;
	
	Return QueryText;
	
EndFunction

// Gets query for supplier settlement document selection for "Payment receipt" and "Cash Reciept" documents.
// 
&AtServerNoContext
Function GetQueryTextDocumentsOfAccountsPayableReceipt()
	
	QueryText =
	"SELECT
	|	UNDEFINED AS Ref,
	|	DATETIME(1, 1, 1) AS Date,
	|	""000000000000"" AS Number,
	|	VALUE(Catalog.Companies.EmptyRef) AS Company,
	|	&CounterpartyByDefault AS Counterparty,
	|	&ContractByDefault AS Contract,
	|	0 AS Amount,
	|	&Currency AS Currency,
	|	UNDEFINED AS Type,
	|	0 AS DocumentStatus
	|WHERE
	|	FALSE
	|";
	
	If AccessRight("Read", Metadata.Documents.ExpenseReport) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	&CounterpartyByDefault,
		|	&ContractByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.ExpenseReport AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.AdditionalExpenses) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	DocumentData.Contract,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.AdditionalExpenses AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.ArApAdjustments) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	&ContractByDefault,
		|	DocumentData.SettlementsAmount,
		|	VALUE(Catalog.Currencies.EmptyRef),
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.ArApAdjustments AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.AccountSalesToConsignor) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	DocumentData.Contract,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE WHEN DocumentData.Posted THEN
		|		1
		|	WHEN DocumentData.DeletionMark THEN
		|		2
		|	ELSE
		|		0
		|	END
		|FROM
		|	Document.AccountSalesToConsignor AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.SubcontractorReport) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	DocumentData.Contract,
		|	DocumentData.Amount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE WHEN DocumentData.Posted THEN
		|		1
		|	WHEN DocumentData.DeletionMark THEN
		|		2
		|	ELSE
		|		0
		|	END
		|FROM
		|	Document.SubcontractorReport AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.SupplierInvoice) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	DocumentData.Contract,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.SupplierInvoice AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.CashVoucher) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	&ContractByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.CashCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.CashVoucher AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.PaymentExpense) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	&ContractByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.CashCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.PaymentExpense AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If Left(QueryText, 10) = "UNION" Then
		QueryText = Mid(QueryText, 14);
	EndIf;
	
	Return QueryText;
	
EndFunction

// Gets a query for selecting accounts receivable documents for "Payment expense" and "Cash payment" documents.
// 
&AtServerNoContext
Function GetQueryTextAccountDocumentsOfAccountsReceivableWriteOff()
	
	QueryText =
	"SELECT
	|	UNDEFINED AS Ref,
	|	DATETIME(1, 1, 1) AS Date,
	|	""000000000000"" AS Number,
	|	VALUE(Catalog.Companies.EmptyRef) AS Company,
	|	&CounterpartyByDefault AS Counterparty,
	|	&ContractByDefault AS Contract,
	|	0 AS Amount,
	|	&Currency AS Currency,
	|	UNDEFINED AS Type,
	|	0 AS DocumentStatus
	|WHERE
	|	FALSE
	|";
	
	If AccessRight("Read", Metadata.Documents.CashReceipt) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	&ContractByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.CashCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.CashReceipt AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.PaymentReceipt) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	&ContractByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.CashCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.PaymentReceipt AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.ArApAdjustments) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	&ContractByDefault,
		|	DocumentData.SettlementsAmount,
		|	VALUE(Catalog.Currencies.EmptyRef),
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.ArApAdjustments AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.AccountSalesFromConsignee) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	DocumentData.Contract,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.AccountSalesFromConsignee AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.SubcontractorReportIssued) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	DocumentData.Contract,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.SubcontractorReportIssued AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.FixedAssetSale) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	DocumentData.Contract,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.FixedAssetSale AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.SalesInvoice) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	DocumentData.Contract,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.SalesInvoice AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If Left(QueryText, 10) = "UNION" Then
		QueryText = Mid(QueryText, 14);
	EndIf;
	
	Return QueryText;
	
EndFunction

// Gets a query for selecting accounts payable documents for "Payment expense" and "Cash payment" documents.
// 
&AtServerNoContext
Function GetQueryTextDocumentsOfAccountsPayableWriteOff()
	
	QueryText =
	"SELECT
	|	UNDEFINED AS Ref,
	|	DATETIME(1, 1, 1) AS Date,
	|	""000000000000"" AS Number,
	|	VALUE(Catalog.Companies.EmptyRef) AS Company,
	|	&CounterpartyByDefault AS Counterparty,
	|	&ContractByDefault AS Contract,
	|	0 AS Amount,
	|	&Currency AS Currency,
	|	UNDEFINED AS Type,
	|	0 AS DocumentStatus
	|WHERE
	|	FALSE
	|";
	
	If AccessRight("Read", Metadata.Documents.AdditionalExpenses) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	DocumentData.Contract,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.AdditionalExpenses AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.SupplierInvoice) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	DocumentData.Contract,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.SupplierInvoice AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.SalesInvoice) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	DocumentData.Contract,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.SalesInvoice AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.AccountSalesToConsignor) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	DocumentData.Contract,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE WHEN DocumentData.Posted THEN
		|		1
		|	WHEN DocumentData.DeletionMark THEN
		|		2
		|	ELSE
		|		0
		|	END
		|FROM
		|	Document.AccountSalesToConsignor AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.SubcontractorReport) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	DocumentData.Contract,
		|	DocumentData.Amount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE WHEN DocumentData.Posted THEN
		|		1
		|	WHEN DocumentData.DeletionMark THEN
		|		2
		|	ELSE
		|		0
		|	END
		|FROM
		|	Document.SubcontractorReport AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.ArApAdjustments) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	&ContractByDefault,
		|	DocumentData.SettlementsAmount,
		|	VALUE(Catalog.Currencies.EmptyRef),
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.ArApAdjustments AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If Left(QueryText, 10) = "UNION" Then
		QueryText = Mid(QueryText, 14);
	EndIf;
	
	Return QueryText;
	
EndFunction

&AtServerNoContext
Function GetQueryTextDocumentForBankStatementProcessing()
	
	QueryText =
	"SELECT
	|	UNDEFINED AS Ref,
	|	DATETIME(1, 1, 1) AS Date,
	|	""000000000000"" AS Number,
	|	VALUE(Catalog.Companies.EmptyRef) AS Company,
	|	&CounterpartyByDefault AS Counterparty,
	|	&ContractByDefault AS Contract,
	|	0 AS Amount,
	|	&Currency AS Currency,
	|	UNDEFINED AS Type,
	|	0 AS DocumentStatus
	|WHERE
	|	FALSE
	|";
	
	If AccessRight("Read", Metadata.Documents.PaymentExpense) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	&ContractByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.CashCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.PaymentExpense AS DocumentData
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.PaymentReceipt) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	&ContractByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.CashCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.PaymentReceipt AS DocumentData";
		
	EndIf;
	
	If Left(QueryText, 10) = "UNION" Then
		QueryText = Mid(QueryText, 14);
	EndIf;
	
	Return QueryText;
	
EndFunction

// Gets order from the settlement document header.
//
&AtServerNoContext
Function GetOrder(Document, ThisIsAccountsReceivable)
	
	If ThisIsAccountsReceivable Then
		
		If TypeOf(Document) = Type("DocumentRef.SubcontractorReportIssued") Then
			
			Order = Document.SalesOrder;
			
		ElsIf (TypeOf(Document) = Type("DocumentRef.ArApAdjustments")
			OR TypeOf(Document) = Type("DocumentRef.SupplierInvoice")
			OR TypeOf(Document) = Type("DocumentRef.SalesInvoice"))
			AND TypeOf(Document.Order) = Type("DocumentRef.SalesOrder") Then
			
			Order = Document.Order;
			
		Else
			
			Order = Documents.SalesOrder.EmptyRef();
			
		EndIf;
			
	Else
		
		If TypeOf(Document) = Type("DocumentRef.AdditionalExpenses") Then
			
			Order = Document.PurchaseOrder;
			
		ElsIf (TypeOf(Document) = Type("DocumentRef.ArApAdjustments")
			OR TypeOf(Document) = Type("DocumentRef.SupplierInvoice")
			OR TypeOf(Document) = Type("DocumentRef.SalesInvoice"))
			AND TypeOf(Document.Order) = Type("DocumentRef.PurchaseOrder") Then
			
			Order = Document.Order;
			
		Else
			
			Order = Documents.PurchaseOrder.EmptyRef();
			
		EndIf;
		
	EndIf;
	
	Return Order;
	
EndFunction

// Gets payment account associated with the settlement document.
//
&AtServerNoContext
Function GetQuote(Document, Order, ThisIsAccountsReceivable)

	If NOT ThisIsAccountsReceivable Then
		
		Quote = Documents.SupplierQuote.EmptyRef();
		If Not ValueIsFilled(Order) Then
			Return Quote;
		EndIf;
		
		Query = New Query;
		Query.Text = 
		"SELECT ALLOWED
		|	SupplierQuote.Ref AS Quote
		|FROM
		|	Document.SupplierQuote AS SupplierQuote
		|WHERE
		|	SupplierQuote.BasisDocument = &BasisDocument";
		
		Query.SetParameter("BasisDocument", Order);
		Selection = Query.Execute().Select();
		
		If Selection.Count() = 1
			AND Selection.Next() Then
			
			Quote = Selection.Quote;
			
		EndIf;
		
	EndIf;
	
	Return Quote;

EndFunction

// Gets advans payments to supplier.
//
&AtServerNoContext
Function GetQueryTextAdvancePaymentsReceived()
	
	QueryText =
	"SELECT
	|	UNDEFINED AS Ref,
	|	DATETIME(1, 1, 1) AS Date,
	|	""000000000000"" AS Number,
	|	VALUE(Catalog.Companies.EmptyRef) AS Company,
	|	&CounterpartyByDefault AS Counterparty,
	|	&ContractByDefault AS Contract,
	|	0 AS Amount,
	|	&Currency AS Currency,
	|	UNDEFINED AS Type,
	|	0 AS DocumentStatus
	|WHERE
	|	FALSE
	|";
	
	If AccessRight("Read", Metadata.Documents.CashVoucher) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	&ContractByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.CashCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.CashVoucher AS DocumentData
		|		LEFT JOIN Document.TaxInvoiceReceived.BasisDocuments AS BasisDocuments
		|		ON DocumentData.Ref = BasisDocuments.BasisDocument
		|WHERE
		|	BasisDocuments.BasisDocument IS NULL
		|	AND DocumentData.OperationKind = VALUE(Enum.OperationTypesCashVoucher.Vendor)
		|	AND DocumentData.Posted
		|	AND DocumentData.CashCurrency = &Currency
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.PaymentExpense) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	&ContractByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.CashCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.PaymentExpense AS DocumentData
		|		LEFT JOIN Document.TaxInvoiceReceived.BasisDocuments AS BasisDocuments
		|		ON DocumentData.Ref = BasisDocuments.BasisDocument
		|WHERE
		|	BasisDocuments.BasisDocument IS NULL
		|	AND DocumentData.OperationKind = VALUE(Enum.OperationTypesPaymentExpense.Vendor)
		|	AND DocumentData.Posted
		|	AND DocumentData.CashCurrency = &Currency
		|";
		
	EndIf;
	
	If Left(QueryText, 10) = "UNION" Then
		QueryText = Mid(QueryText, 14);
	EndIf;
	
	Return QueryText;
	
EndFunction

// Gets text for the Tax invoice received.
//
&AtServerNoContext
Function GetQueryTextTaxInvoiceReceived()
	
	QueryText =
	"SELECT
	|	UNDEFINED AS Ref,
	|	DATETIME(1, 1, 1) AS Date,
	|	""000000000000"" AS Number,
	|	VALUE(Catalog.Companies.EmptyRef) AS Company,
	|	&CounterpartyByDefault AS Counterparty,
	|	&ContractByDefault AS Contract,
	|	0 AS Amount,
	|	&Currency AS Currency,
	|	UNDEFINED AS Type,
	|	0 AS DocumentStatus
	|WHERE
	|	FALSE
	|";
	
	If AccessRight("Read", Metadata.Documents.DebitNote) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	&ContractByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.DebitNote AS DocumentData
		|		LEFT JOIN Document.TaxInvoiceReceived.BasisDocuments AS BasisDocuments
		|		ON DocumentData.Ref = BasisDocuments.BasisDocument
		|WHERE
		|	BasisDocuments.BasisDocument IS NULL
		|	AND DocumentData.Posted
		|	AND DocumentData.DocumentCurrency = &Currency
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.SupplierInvoice) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	&ContractByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.SupplierInvoice AS DocumentData
		|		LEFT JOIN Document.TaxInvoiceReceived.BasisDocuments AS BasisDocuments
		|		ON DocumentData.Ref = BasisDocuments.BasisDocument
		|WHERE
		|	BasisDocuments.BasisDocument IS NULL
		|	AND DocumentData.Posted
		|	AND DocumentData.DocumentCurrency = &Currency
		|";
		
	EndIf;
	
	If Left(QueryText, 10) = "UNION" Then
		QueryText = Mid(QueryText, 14);
	EndIf;
	
	Return QueryText;
	
EndFunction

// Gets advans payments from customer.
//
&AtServerNoContext
Function GetQueryTextAdvancePaymentsIssued()
	
	QueryText =
	"SELECT
	|	UNDEFINED AS Ref,
	|	DATETIME(1, 1, 1) AS Date,
	|	""000000000000"" AS Number,
	|	VALUE(Catalog.Companies.EmptyRef) AS Company,
	|	&CounterpartyByDefault AS Counterparty,
	|	&ContractByDefault AS Contract,
	|	0 AS Amount,
	|	&Currency AS Currency,
	|	UNDEFINED AS Type,
	|	0 AS DocumentStatus
	|WHERE
	|	FALSE
	|";
	
	If AccessRight("Read", Metadata.Documents.CashVoucher) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	&ContractByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.CashCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.CashReceipt AS DocumentData
		|		LEFT JOIN Document.TaxInvoiceIssued.BasisDocuments AS BasisDocuments
		|		ON DocumentData.Ref = BasisDocuments.BasisDocument
		|WHERE
		|	BasisDocuments.BasisDocument IS NULL
		|	AND DocumentData.OperationKind = VALUE(Enum.OperationTypesCashReceipt.FromCustomer)
		|	AND DocumentData.Posted
		|	AND DocumentData.CashCurrency = &Currency
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.PaymentExpense) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	&ContractByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.CashCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.PaymentReceipt AS DocumentData
		|		LEFT JOIN Document.TaxInvoiceIssued.BasisDocuments AS BasisDocuments
		|		ON DocumentData.Ref = BasisDocuments.BasisDocument
		|WHERE
		|	BasisDocuments.BasisDocument IS NULL
		|	AND DocumentData.OperationKind = VALUE(Enum.OperationTypesPaymentReceipt.FromCustomer)
		|	AND DocumentData.Posted
		|	AND DocumentData.CashCurrency = &Currency
		|";
		
	EndIf;
	
	If Left(QueryText, 10) = "UNION" Then
		QueryText = Mid(QueryText, 14);
	EndIf;
	
	Return QueryText;
	
EndFunction

// Gets text for the Tax invoice issued.
//
&AtServerNoContext
Function GetQueryTextTaxInvoiceIssued()
	
	QueryText =
	"SELECT
	|	UNDEFINED AS Ref,
	|	DATETIME(1, 1, 1) AS Date,
	|	""000000000000"" AS Number,
	|	VALUE(Catalog.Companies.EmptyRef) AS Company,
	|	&CounterpartyByDefault AS Counterparty,
	|	&ContractByDefault AS Contract,
	|	0 AS Amount,
	|	&Currency AS Currency,
	|	UNDEFINED AS Type,
	|	0 AS DocumentStatus
	|WHERE
	|	FALSE
	|";
	
	If AccessRight("Read", Metadata.Documents.CreditNote) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	&ContractByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.CreditNote AS DocumentData
		|		LEFT JOIN Document.TaxInvoiceReceived.BasisDocuments AS BasisDocuments
		|		ON DocumentData.Ref = BasisDocuments.BasisDocument
		|WHERE
		|	BasisDocuments.BasisDocument IS NULL
		|	AND DocumentData.Posted
		|	AND DocumentData.DocumentCurrency = &Currency
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.SalesInvoice) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	&ContractByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.SalesInvoice AS DocumentData
		|		LEFT JOIN Document.TaxInvoiceReceived.BasisDocuments AS BasisDocuments
		|		ON DocumentData.Ref = BasisDocuments.BasisDocument
		|WHERE
		|	BasisDocuments.BasisDocument IS NULL
		|	AND DocumentData.Posted
		|	AND DocumentData.DocumentCurrency = &Currency
		|";
		
	EndIf;
	
	If Left(QueryText, 10) = "UNION" Then
		QueryText = Mid(QueryText, 14);
	EndIf;
	
	Return QueryText;
	
EndFunction

#EndRegion

#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	ThisIsAccountsReceivable = Parameters.ThisIsAccountsReceivable;
	
	ThisIsBankStatementProcessing = Parameters.Property("ThisIsBankStatementProcessing");
	ThisIsAdvancePaymentsReceived = Parameters.Property("ThisIsAdvancePaymentsReceived");
	ThisIsAdvancePaymentsIssued = Parameters.Property("ThisIsAdvancePaymentsIssued");
	ThisIsTaxInvoiceReceived = Parameters.Property("ThisIsTaxInvoiceReceived");
	ThisIsTaxInvoiceIssued = Parameters.Property("ThisIsTaxInvoiceIssued");
	
	DocumentType = Parameters.DocumentType;
	
	If DocumentType = Type("DocumentRef.PaymentReceipt")
		OR DocumentType = Type("DocumentRef.CashReceipt") 
		OR DocumentType = Type("DocumentRef.DebitNote") Then
		
		If ThisIsAccountsReceivable Then
			List.QueryText = GetQueryTextAccountDocumentsOfAccountsReceivableReceipt();
		Else
			List.QueryText = GetQueryTextDocumentsOfAccountsPayableReceipt();
		EndIf;
		
	Else
		
		If ThisIsAccountsReceivable Then
			List.QueryText = GetQueryTextAccountDocumentsOfAccountsReceivableWriteOff();
		ElsIf ThisIsBankStatementProcessing Then
			List.QueryText = GetQueryTextDocumentForBankStatementProcessing();
		ElsIf ThisIsAdvancePaymentsReceived Then
			List.QueryText = GetQueryTextAdvancePaymentsReceived();
		ElsIf ThisIsAdvancePaymentsIssued Then
			List.QueryText = GetQueryTextAdvancePaymentsIssued();
		ElsIf ThisIsTaxInvoiceReceived Then
			List.QueryText = GetQueryTextTaxInvoiceReceived();
		ElsIf ThisIsTaxInvoiceIssued Then
			List.QueryText = GetQueryTextTaxInvoiceIssued();
		Else
			List.QueryText = GetQueryTextDocumentsOfAccountsPayableWriteOff();
		EndIf;
		
	EndIf;
	
	Items.Company.Visible = Not Parameters.Filter.Property("Company");
	
	If Parameters.Filter.Property("Counterparty") Then
		Items.Counterparty.Visible = True;
		List.Parameters.SetParameterValue("CounterpartyByDefault", Parameters.Filter.Counterparty);
	Else
		Items.Counterparty.Visible = False;
		List.Parameters.SetParameterValue("CounterpartyByDefault", Catalogs.Counterparties.EmptyRef());
	EndIf;
	
	If Parameters.Filter.Property("Contract") Then
		List.Parameters.SetParameterValue("ContractByDefault", Parameters.Filter.Contract);
	Else
		List.Parameters.SetParameterValue("ContractByDefault", Catalogs.CounterpartyContracts.EmptyRef());
	EndIf;
	
	If Parameters.Filter.Property("Currency") Then
		List.Parameters.SetParameterValue("Currency", Parameters.Filter.Currency);
	ElsIf Parameters.Filter.Property("DocumentCurrency") Then
		List.Parameters.SetParameterValue("Currency", Parameters.Filter.DocumentCurrency);
	Else
		List.Parameters.SetParameterValue("Currency", Catalogs.Currencies.EmptyRef());
	EndIf;
	
EndProcedure

#EndRegion

#Region ActionsOfTheFormCommandPanels

// The procedure is called when clicking button "Select".
//
&AtClient
Procedure ChooseDocument(Command)
	
	CurrentData = Items.List.CurrentData;
	If CurrentData <> Undefined Then
		
		DocumentData = New Structure;
		DocumentData.Insert("Document", CurrentData.Ref);
		DocumentData.Insert("Contract", CurrentData.Contract);
		
		Order = GetOrder(CurrentData.Ref, ThisIsAccountsReceivable);
		DocumentData.Insert("Order", Order);
		
		Quote = GetQuote(CurrentData.Ref, Order, ThisIsAccountsReceivable);
		DocumentData.Insert("Quote", Quote);
		
		NotifyChoice(DocumentData);
	Else
		Close();
	EndIf;
	
EndProcedure

// The procedure is called when clicking button "Open document".
//
&AtClient
Procedure OpenDocument(Command)
	
	TableRow = Items.List.CurrentData;
	If TableRow <> Undefined Then
		ShowValue(Undefined,TableRow.Ref);
	EndIf;
	
EndProcedure

#EndRegion

#Region FormFieldEventHandlers

&AtClient
Procedure ListSelection(Item, SelectedRow, Field, StandardProcessing)
	
	CurrentData = Items.List.CurrentData;
	
	DocumentData = New Structure;
	DocumentData.Insert("Document", CurrentData.Ref);
	DocumentData.Insert("Contract", CurrentData.Contract);
	
	Order = GetOrder(CurrentData.Ref, ThisIsAccountsReceivable);
	DocumentData.Insert("Order", Order);
	
	Quote = GetQuote(CurrentData.Ref, Order, ThisIsAccountsReceivable);
	DocumentData.Insert("Quote", Quote);
	
	NotifyChoice(DocumentData);
	
EndProcedure

#EndRegion
